_posts/2015-08-31-still-ill-and-a-test.html
---
layout: post
title: "Still ill..and a test"
tags:
- emacs
- org-mode
- blog
---
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Still ill</h2>
<div class="outline-text-2" id="text-1">
<p>
This head cold sucks and nothing is seeming to shift it.
</p>

<p>
However, I thought I would do some more blogging and see if I can get my emacs-&gt;blog workflow underway, and the answer is yes - woot!
</p>

<p>
<i>(drum roll&#x2026;)</i>
</p>

<p>
This post was written entirely in <code>org-mode</code> with a <a href="http://emacswiki.org/emacs/Yasnippet">yasnippet</a> for the header:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"># -*- mode: snippet -*-
#name : blog-head
#key : blog-head
#contributor : Colin Yates
# --
#+BEGIN_HTML
---
layout: post
title: "$1"
tags:
- $2
---
#+END_HTML
$0
</pre>
</div>

<p>
I've got to stop as I have already spent too much time <a href="https://en.wiktionary.org/wiki/yak_shaving">yak shaving</a> and messing up:
</p>

<blockquote class="twitter-tweet" lang="en"><p lang="en" dir="ltr">that feeling of deleting the wrong directory and associated buffers for uncommitted files. I shouldn&#39;t work with a head-cold. <a href="https://twitter.com/hashtag/fail?src=hash">#fail</a></p>&mdash; Colin Yates (@yatesco) <a href="https://twitter.com/yatesco/status/638337979640057856">August 31, 2015</a></blockquote> <script async src="//platform.twitter.com/widgets.js" charset="utf-8"></script>

<p>
When I can think straight I will publish more.
</p>
</div>
</div>
